{"_id":{"$oid":"5cf677502277ec7dc4932885"},"title":"7 secrets for the perfect caffe latte","description":"Caffe Latte is one of the most popular espresso based coffee drinks sold in cafes and espresso bars.Ever wondered how to make a cafe quality caffe latte at home? With a quality espresso machine and some good technique it is easy to achieve cafe quality caffe latte at home.","text":"### 1 Use the right type of glass(es).... and remember to heat them  \n\nCaffe Latte is served in glass tumblers with a volume of 170-200ml. Caffe Latte is only ever served in a glass; if you use a cup then you are making a flat white or cappuccino, a mug is for hot chocolate and filter coffee.\n\nUsing a good quality glass that is the right size will not only give your drinks that cafe quality appearance, but will help you achieve the correct proporations of coffee, milk, and foam.\n\nIf your espresso machine has the facility to head the cups on top, the store your cups here; if not then fill the glasses with boiling water and stand for one minute to pre-heat the glasses. Discard the water just prior to extracting your espresso.\n\n### 2 Use fresh whole milk\n\nFor a well made caffe latte you need to use fresh whole milk (fat content 3.3-4.0%, protein 3.2%-3.3%). Both the fat and  protein content are critical to developing, stabilising, and supporting the thick velvety texture created by the milk microfoam; using trim milk will make it more difficult to achieve a nice velvet microfoam and the texture will be lacking in body. All good cafes use whole milk for cafe lattes so you should too.\n\n### 3 Select the appropriate sized milk jug and use only enough milk\n\nYour milk pitcher should be approximately half full with fresh whole milk before steaming; this allows sufficient volume to stretch the milk and inject texture without the jug overflowing. Steamed milk cannot be reused for caffe latte due to two factors (a) steaming milk injects approximately 10% water into the milk diluting the flavour and intensity (b) steaming milk progressively breaks down the protein structure diminishing texture and body.\n\nExcess steamed milk should be discarded or used for making hot chocolate. To avoid heating excess steamed milk it is important to select the approprate sized jug for the number of drinks you are making. If you are just making one caffe latte for yourself, use a 300ml stainless jug; if you are making two caffe lattes for yourself and a friend, use a 600ml stainless jug.\n\n### 4 Dont overheat the milk or expand it too much  \n\nCaffe latte relies on milk with a velvety texture to carry the espresso and to delivery the right feel in the mouth. Expanding the milk too much will create too much fluffy foam, overheating the milk will cause the texture and body of the milk to break down.\n\n### 5 Extract perfect espresso into your preheated glass(es)  \n\nEspresso is the basis for the caffe latte so producing a quality caffe latte requires quality espresso. Good quality espresso is 25-30ml extracted in 25-30 seconds from 7-9 grams of ground coffee. Espresso should have a thick dark consistency topped with a golden brown layer of crema. The crema layer is where much of the aroma and flavour is derived from, so you want to try and avoid disturbing this layer as much as possible.\n\nExtracting espresso into a shot glass and pouring this into your caffe latte glass will cause the crema to dissipate prematurely. Extract your espresso directly into your preheated caffe latte glass(es) then add steamed milk.\n\n### 6 Pour steamed milk through the crema layer  \n\nA perfect caffe latte should be brown on top, this surface is the crema supported by the microfoam from the milk. A poor quality caffe latte will often have a white layer of milk foam on top, the result is pretty much the taste of milk with every sip. If there is a layer of foam on your steamed milk this can be scooped off with a spoon or held back during the pouring process with a spoon, knife, or spatula.\n\nPour the velvety milk into the glass so that the stream of milk penetrates the crema layer and fills the cup from below this layer, bringing it to the surface.\n\n### 7 Focus on taste and texture - latte art is optional  \n\nLatte art is great, but it contributes nothing to the taste and texture of the drink. Focus on extracting good espresso, steaming velvety milk, and pouring the milk to that the crema is suspended on the top of the drink.","category":{"$oid":"5cf671442277ec7dc493287f"},"createdAt":{"$date":{"$numberLong":"1559656272278"}},"updatedAt":{"$date":{"$numberLong":"1559656272278"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf678352277ec7dc4932886"},"title":"The best lemonade you’ll ever have (with a secret ingredient!)","description":"Honey and lemons are a natural pairing, curing the common cold with their soothing warmth of sweetness and tang. So in our recipe, we’ve added a touch of light clover honey which sets our icy cup apart from the other neighborhood kids.","text":"### The Best Lemonade You’ll Ever Have\n\nBefore my son’s school year ended, we were already making plans for our summer project: a lemonade stand. While we’re still in negotiations with our six-year-old over exactly what the structure of the stand will entail, one thing is for sure—we’ve nailed our lemonade recipe.\n\nHoney and lemons are a natural pairing, curing the common cold with their soothing warmth of sweetness and tang. So in our recipe, we’ve added a touch of light clover honey which sets our icy cup apart from the other neighborhood kids.\n\nRegardless of how our stand shapes up, we can be sure to attract many a thirsty sidewalk traveler with our special brew. If you’re in Seattle, seek out our stand—and if not, whisk up a batch of this summer standard yourself.\n\nRecipe: The Best Lemonade  \nMakes 6-8 servings\n\nThis is our base recipe but we’ve been known to steep rosemary in the mix, toss in fresh strawberries, or add shot of vodka or gin for the adults. (Add herbs while the syrup is still warm and then let steep as the syrup cools in the fridge. For a stronger flavor, you can boil the herbs with the syrup.)\n\nYou’ll need:  \n- ¼ cup honey (use a light-flavored honey such as clover)  \n- ¼ cup sugar  \n- 1 cup water  \n- 1 cup fresh lemon juice (about 6 to 8 lemons)  \n- 2-3 cups water (for diluting)\n\nIn a small saucepan, combine the honey, sugar and 1 cup water. Bring to a boil, then turn off the heat. Give this mixture a quick stir to ensure all the sugar has dissolved. Chill this syrup in the fridge.\n\nMeanwhile, juice enough lemons to produce 1 cup of lemon juice. (I like a bit of pulp in my lemonade, so I strain the juice and then add back a bit of pulp.)\n\nWhen the syrup is cool, combine it with the lemon juice in a pitcher. Add in 2 cups water. (I prefer my lemonade strong but if it’s a bit too strong for you simply add more water.) Add ice and enjoy in the sun.\n\n_Mix it up: This is our base recipe but we’ve been known to steep rosemary or lavender (add them to the warm syrup, so they can steep while it chills), toss in fresh strawberries, or add shot of vodka or gin for the adults._","category":{"$oid":"5cf66f962277ec7dc493287c"},"createdAt":{"$date":{"$numberLong":"1559656501027"}},"updatedAt":{"$date":{"$numberLong":"1559656501027"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf7a8bb16ecd9bdb4a20850"},"title":"Fresh cucumber ming lemonade","description":"Who doesn’t like lemonade on a boiling summer day? Do you make it yourself or just prefer something store bought? It might seem the easiest way, but definitely not the tastiest!","text":"### Fresh cucumber ming lemonade\n\nWho doesn’t like lemonade on a boiling summer day? Do you make it yourself or just prefer something store bought? It might seem the easiest way, but definitely not the tastiest!\n\n### What Goes In This Cucumber Mint Lemonade?\n\nNothing could be better for refreshment than a big pitcher of cucumber lemonade cocktail because it is homemade. It contains:\n\n-   cucumber\n-   mint\n-   lemon zest\n-   lemon juice\n-   water\n-   sugar\n\nThey go wonderfully together to make this amazing yet easy summer beverage. I love to serve it with lots of ice, cucumber slices and mint sprigs.\n\nIf you are planning to hold a summer party and prefer an alcoholic cocktail, you can easily turn it into a cucumber lemonade vodka recipe.\n\nLemonade is a classic favorite summer drink in Turkey just like in most Middle Eastern countries. I wanted to go a little further from the classic version, which is based on lemon and no other flavors. The most common flavor to pair with lemon in this summer drink is fresh mint. You can toss in a few sprigs of mint in your lemonade and that’s it. But why not try new flavors? I’ve tried [ginger lemonade](https://www.giverecipe.com/the-best-lemonade/), [strawberry lemonade](https://www.giverecipe.com/perfect-strawberry-lemonade/) and marjoram in an [old fashioned homemade lemonade](https://www.giverecipe.com/fresh-homemade-lemonade/) recipe so far and they all made perfect combination! It’s time to create a cucumber lemonade recipe now!","category":{"$oid":"5cf66f962277ec7dc493287c"},"createdAt":{"$date":{"$numberLong":"1559734459147"}},"updatedAt":{"$date":{"$numberLong":"1559734459147"}},"__v":{"$numberInt":"0"}}
