{"_id":{"$oid":"5cf624dc79ee065d84ba26b7"},"title":"The best oreo dirt cake","text":"\n![image](https://joyfoodsunshine.com/wp-content/uploads/2019/05/dirt-cake-recipe-1.jpg)\n\n> This Easy Dirt Cake Recipe (Oreo Dirt Pudding) is one of our favorite no-bake desserts! Crushed Oreos are layered between a French vanilla pudding mixture for a kid-friendly, make-ahead dessert recipe perfect for any potluck or BBQ! Add gummy worms for a whimsical touch!\n\n###  Ingredients\n-   3½  cups  milk-   2  (3.4 oz) packages  [Jello instant French vanilla pudding](https://amzn.to/2K8Dow7)\n-   1  [package Oreo cookies](https://rstyle.me/+f7Hwl_FfdVHad6S7oXVBrA)  divided\n-   ½  cup  butter  room temperature\n-   8  oz  cream cheese  room temperature\n-   1  cup  [powdered sugar](http://amzn.to/2A0lYgI)\n-   8  oz  [cool whip](https://rstyle.me/+Y2wAiKEJtpP-MAvMy6kY0Q)  thawed in the refrigerator\n-   Gummy worms  optional\n\n### Cooking\n\n#### STEP 1: COMBINE THE PUDDING & MILK\n\nThe French Vanilla Pudding needs to be mixed with the milk and then put in the fridge to set. Which is why I recommend doing this step first so that it can set while you’re mixing the rest of the pudding ingredients together and chopping the Oreos!\n\n#### STEP 2: CHOP SOME OF THE OREOS\n\nRemove eight Oreos (or more if you bought a family-sized bag) from the package and chop them into 1/4″ to 1/2″ pieces. This simple step makes this dirt cake recipe extra special. My absolute _favorite_  bites of this dirt pudding are the ones that contain big chunks of soft Oreos. They have the best texture after they’re pudding-infused from chilling overnight! Trust me, don’t skip this step!\n\n#### STEP 3: CRUSH THE REST OF THE OREOS\n\nAfter you’ve chopped a few Oreos, crush the rest. It’s very easy to do this in a food processor fitted with an “S” blade. Just be aware that you may have to pause, release any Oreos that get stuck to the blades, and process some more!If you don’t have a food processor you can use a rolling pin. Just be sure to crush them into a fine powder so they look like dirt!!\n\n#### STEP 4: MAKE THE PUDDING LAYER\n\nThe key to this step is to make sure the butter and cream cheese are softened and at room temperature so they’re easy to combine! I recommend using a standing mixer, but I used a hand mixer (for shooting purposes) with great success!All the rest of the directions in this part are very straightforward! Just be sure to beat the ingredients well after each addition so that the mixture is smooth and there are no lumps.\n\n#### STEP 5: LAYER THE PUDDING & OREOS TO MAKE THE DIRT CAKE\n\nNow that you have made the pudding and prepared the “dirt” (Oreos) it’s time to layer them together to make this Oreo Dirt Cake! Each layer consists of the following:-   2 cups of pudding mixture-   1/2 cup crushed Oreos-   1/4 cup chopped OreosThen repeat until all the ingredients have been used. Just be sure to end with a layer of Oreos! These amounts of ingredients will differ if you use a different serving dish other than this [glass trifle dish](https://rstyle.me/+gXP6pSCzhBZRxPkSjyvjYg). I discuss more serving options below!\n\n#### STEP 6: ADD GUMMY WORMS\n\nFor a fun addition, add some gummy worms to the top of the dirt cake once you have finished layering. You could add them as you go on top of each dirt layer if you really love them! I personally don’t prefer the fruity taste in my Oreo Dirt Cake, so I choose to just put them on top and serve extras on the side!\n\n#### STEP 7: CHILL OVERNIGHT\n\nChilling this Oreo Dirt Cake recipe overnight is critical to achieve the best flavor and texture. The pudding and Oreos meld together and become an out-of-this-world delicious dessert! Simply cover the trifle dish with plastic wrap and place it in the refrigerator overnight.","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2019/05/dirt-cake-recipe-4.jpg","category":{"$oid":"5cf620852e17ef5880fd001a"},"createdAt":{"$date":{"$numberLong":"1559635164188"}},"updatedAt":{"$date":{"$numberLong":"1559648343437"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf65747421e6154508a74bc"},"title":"No-bake vegan chocolate peanut butter cheesecake","text":"![image](https://joyfoodsunshine.com/wp-content/uploads/2017/10/No-Bake-Vegan-Chocolate-Peanut-Butter-Cheesecake-gluten-free-refined-sugar-free-5-768x813.jpg)\n> This No-Bake Vegan Chocolate Peanut Butter Cheesecake recipe is a healthy yet decadent dessert! Gluten-free, dairy-free, vegan, and paleo-friendly!\n\nTo be honest, I don’t really care all that much about my birthday! I’ve never been the type of person who feels like the entire day {or week, or month for that matter} needs to be all about me. I mean, it was my mom who did all the work the day I was born {can I get an _amen_  ladies}?! But it is a great excuse to take a break from cooking, doing the dishes and changing diapers for a day. So I’ll take it!\n\nThis No-Bake Vegan Chocolate Peanut Butter Cheesecake is exactly the  [dessert](https://joyfoodsunshine.com/black-bean-brownies/)  I want to celebration with this year! It’s vegan, gluten-free dairy free and has no refined sugar! It’s also paleo-friendly! However, even though it’s healthy, it is not lacking in the deep, rich chocolate peanut butter flavor department. No in the slightest\n\n### Ingredients\n\n#### Crust:\n\n-   ½  cup  raw pecans\n-   ½  cup  [dates](http://amzn.to/2ijG8aW)  pitted (don’t forget to remove the pits)!!\n-   1 ½  TBS  [unsweetened cocoa powder](http://amzn.to/2yIAnKn)\n-   2  TBS  [unsweetened, shredded coconut](http://amzn.to/2D8FnLp)\n-   1  TBS  [honey or pure maple syrup](http://amzn.to/2hwJnvf)\n-   ¼  tsp  [sea salt](https://amzn.to/2Hh1yD8)\n\n#### Filling\n\n-   1  cup  [roasted, unsalted cashews](http://amzn.to/2BadAbY)  soaked for at least 1 hour\n-   6  TBS  [pure maple syrup](http://amzn.to/2ijO0cB)\n-   ¼  cup  [coconut oil](http://amzn.to/2yIWdNO)  melted\n-   ¼  cup  [unsweetened chocolate](http://amzn.to/2yK2f0q)  or semi-sweet chocolate chips, melted\n-   ¼  cup  [creamy peanut butter](https://amzn.to/2VccFkb)\n-   ½  cup  [coconut cream](http://amzn.to/2ik89zw)\n-   1  tsp  [pure vanilla extract](https://amzn.to/2SR9w7T)\n-   2  TBS  [unsweetened cocoa powder](http://amzn.to/2yIAnKn)\n-   ¼  tsp  [sea salt](https://amzn.to/2Hh1yD8)\n\n#### Chocolate peanut butter topping:\n\n-   ¼  cup  [semi-sweet chocolate chips](http://amzn.to/2yISaRy)\n-   2  TBS  [creamy peanut butter](https://amzn.to/2VccFkb)\n\n### Cooking\n1.  First, soak 1 cup of cashews in enough boiling water to cover them for at least 1 hour. After 1 hour rinse and drain and proceed with the recipe.\n    \n\n#### Crust:\n\n1.  Line a 6” round cake pan (deep) with parchment paper. Set aside.\n    \n2.  Put dates and pecans in the container of a  [Vitamix blender](http://www.dpbolvw.net/click-8438233-13084479)  or a food processor fitted with the “S” blade. Process until mixture is resembles a coarse meal and is uniform throughout.\n    \n3.  Add the rest of the to the blender/food processor and blend/process until the mixture just starts to clump together. (Do not over process here or the bites will become oily)!\n    \n4.  Pour the mixture into the prepared pan and press it evenly into the bottom of the pan.\n    \n5.  Put the pan with the crust in it in the refrigerator while you make the filling.\n    \n\n#### Filling:\n\n1.  In a microwave safe dish or in a small pan over medium-low heat melt together the peanut butter, chocolate, maple syrup and coconut oil until smooth. Set aside.\n    \n2.  Place the soaked, rinsed and drained cashews and the coconut cream into the container of your Vitamix blender. Blend until smooth.\n    \n3.  Add the melted chocolate, peanut butter & coconut oil mixture, vanilla extract, cocoa powder and salt to the Vitamix/blender. Blend for 30-60 seconds or until silky smooth. You may need to stop, scrape down the sides and continue blending.\n    \n4.  Pour the filling into the prepared pan and evenly spread it over the crust.\n    \n5.  Place the pan back in the refrigerator until it sets up and becomes solid (about 1-2 hours).\n    \n\n#### Topping:\n\n1.  Melt ¼ cup chopped semisweet chocolate or chocolate chips with 2 TBS peanut butter and stir until smooth. Evenly spread over firm filling. Return to fridge to set.\n    \n2.  To serve, remove from fridge and let sit at room temperature for 20 minutes. This tastes the best when it’s not straight out of the fridge and has a little time to sit at room temperature!","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2017/10/No-Bake-Vegan-Chocolate-Peanut-Butter-Cheesecake-gluten-free-refined-sugar-free-5-768x813.jpg","category":{"$oid":"5cf620852e17ef5880fd001a"},"createdAt":{"$date":{"$numberLong":"1559648071641"}},"updatedAt":{"$date":{"$numberLong":"1559648434189"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf65a91421e6154508a74bd"},"title":"Molten chocolate lava cake","text":"![image](https://joyfoodsunshine.com/wp-content/uploads/2019/01/molten-chocolate-lava-cake-recipe-8-830x1024.jpg)\n\nThese Molten Chocolate Lava Cakes are a rich, decadent, gourmet dessert that are surprisingly easy and uncomplicated to make! They come together from start to finish in under 20 minutes, and are sure to wow your dinner guests!\n\n### Ingredients\n\n-   ½  cup  salted butter\n-   6  oz (3/4 cup) [semisweet chocolate](https://amzn.to/2E78K44) (chips or chopped)\n-   3  large eggs\n-   ¼  cup  [granulated sugar](http://amzn.to/2hw1yRH)\n-   1/8  tsp  [sea salt](https://amzn.to/2Hh1yD8)\n-   ½  tsp  [pure vanilla extract](https://amzn.to/2SR9w7T)\n-   1  TBS  [flour](https://amzn.to/2FBcdIy)\n\n### Cooking\n\n#### GATHER MATERIALS/INGREDIENTS\n\nThe first thing I like to do is gather all of the materials and ingredients necessary to make this molten lava cake recipe. There are only six ingredients, so this part is a breeze.\n\n#### 2. MELT THE CHOCOLATE & BUTTER TOGETHER\n\nThe next step in making this chocolate lava cake recipe is to melt the butter and chocolate together. This can be done in one of two ways:\n\n1.  **In the microwave.**  Put the butter & chocolate in a microwave-safe bowl and warm until just melted (about 60-90 seconds). Start by warming for 60 seconds, stirring, and then warming in 30 second increments stirring after each until the mixture is melted and smooth.\n2.  **On the stovetop over medium-low heat**. You can also gently melt the butter and chocolate together in a small saucepan on the stovetop over low heat. Be sure to stir consistently and remove the pan from the heat as soon as the mixture is smooth.\n\n#### 3. BEAT THE EGGS.\n\nUsing either a standing mixer or hand mixer, beat the eggs until they are light and pale (for about 60 seconds). This is an important step for the overall texture and heartiness of this chocolate lava cake recipe, so please don’t skip it!\n\n#### 4. ADD SUGAR & SALT AND BEAT AGAIN.\n\nOnce the eggs are light and pale, add sugar and salt and beat until the sugar is completely dissolved.\n\n#### 5. ADD MELTED CHOCOLATE & VANILLA…AND BEAT AGAIN.\n\nDo you sense a “beating” theme in this recipe? By this point the melted chocolate should have cooled slightly, and is ready to be added to the molten lava cake batter (along with the vanilla).\n\n#### 6. ADD FLOUR AND MIX UNTIL JUST COMBINED.\n\nLast, but not least, add the flour of your choice (see notes on what types I recommend later on in the post or in the recipe card). This time, mix the batter on low speed until the flour is just combined.\n\n#### 7. POUR INTO BAKING CUPS & BAKE\n\nPlace the  [silicone baking cups](https://amzn.to/2SZiDUV)  or  [silicone muffin pan](https://amzn.to/2U1DzLb)  on a flat baking sheet. Use a 1/2 cup measuring cup to scoop the batter evenly into the baking cups or the wells of a muffin tin. These are large baking cups (3 1/2″), so the recipe yields four chocolate lava cakes which take roughly 10-12 minutes to bake.\n\n#### 8. LET THE CHOCOLATE LAVA CAKE COOL SLIGHTLY.\n\nLet the molten lava cake cool for 2-3 minutes in the baking cups before removing. This will ensure that the cakes hold up when transferred. The tops will sink a little bit as they cool, which is completely normal.\n\n#### 9. TURN CHOCOLATE LAVA CAKES OUT ONTO SERVING PLATES.\n\nCarefully turn each chocolate lava cake out onto a serving plate, and gently remove the silicone cup from over the top of it.","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2019/01/molten-chocolate-lava-cake-recipe-8-830x1024.jpg","category":{"$oid":"5cf620852e17ef5880fd001a"},"createdAt":{"$date":{"$numberLong":"1559648913085"}},"updatedAt":{"$date":{"$numberLong":"1559648913085"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf6717c2277ec7dc4932880"},"title":"Homemade strawberry lemonade","text":"![image](https://joyfoodsunshine.com/wp-content/uploads/2019/05/healthy-strawberry-lemonade-recipe-6.jpg)\n\nThis Easy Homemade Strawberry Lemonade recipe is a refreshing summer drink made with only 4 healthy ingredients including fresh strawberries and honey! Skip the store bought varieties riddled with artificial ingredients, corn syrup and food dyes and make your own, more delicious strawberry lemonade today!\n### HOW DO YOU MAKE HOMEMADE STRAWBERRY LEMONADE?\n\nThis strawberry lemonade recipe is so easy to make, but I want to give you a few tips and tricks to ensure your success!\n\n### USE A  [VITAMIX BLENDER](http://www.jdoqocy.com/click-8438233-13084479).\n\nI couldn’t post a blender recipe without (once again) reminding you that in a world full of blenders,  [Vitamix](http://www.jdoqocy.com/click-8438233-13084479)  out-performs them all. To get the smoothest strawberry lemonade that you  **don’t need to strain**, I highly recommend using a Vitamix to make this strawberry lemonade recipe, although any blender will work! Click on this post to see my  [recommendations for buying a Vitamix](https://joyfoodsunshine.com/best-vitamix-blender/)  if you’re in the market for one!\n\n### STEP 1: BLEND WATER & STRAWBERRIES TOGETHER\n\nRemember, when you’re blending it’s important to always add liquids into the blending container first! So in this recipe begin by adding water followed by the strawberries!\n\nBlending the water and strawberries together first until the mixture is completely smooth ensures there will be no seeds or strawberry pieces left in the final product and no need to add the extra step of straining! It also prevents any honey from getting stuck to the bottom of the blending container (especially if you’re using a less powerful blender).\n\n#### STEP 2: ADD LEMON JUICE & SWEETENER AND BLEND.\n\nNow dump the rest of the ingredients into the container and blend for 30 seconds. The goal of this step is to make sure the honey (or sugar) is completely dissolved!\n\n#### STEP 3: ADD MORE WATER AND BLEND\n\nAdd the last cup of water and blend for 10 seconds or until the mixture is homogenous!\n\nYou will notice that there is a significant amount of froth after the blending is complete. That’s totally normal and it settles and disappears during chilling!\n\n#### STEP 4: TASTE THE STRAWBERRY LEMONADE & ADJUST\n\nAfter all 3 cups of water and 3/4 cup of honey have been added, pour yourself a sip and taste the Strawberry Lemonade. I have found that the sweetness of the strawberries changes the amount of honey I prefer to use.\n\n#### STEP 5: CHILL\n\nGrab yourself a 2 liter pitcher and put 2 cups of ice in it. Pour the lemonade into the pitcher with ice and place it in the refrigerator for at least 2 hours (preferably longer to fully chill).\n\n#### STEP 6: ENJOY!\n\nServe this Strawberry Lemonade cold over ice after a long day of fun in the sun! It’s a delicious and healthier alternative to lemonade mixes that everyone will love!","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2019/05/healthy-strawberry-lemonade-recipe-6.jpg","category":{"$oid":"5cf66f962277ec7dc493287c"},"createdAt":{"$date":{"$numberLong":"1559654780126"}},"updatedAt":{"$date":{"$numberLong":"1559654780126"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf672502277ec7dc4932881"},"title":"Strawberry banana smoothie","text":"![image](https://joyfoodsunshine.com/wp-content/uploads/2019/01/healthy-strawberry-banana-smoothie-recipe-7-849x1024.jpg)\n\nThe BEST strawberry banana smoothie recipe ever! It’s easy (ready in less than 5 minutes), healthy, and made with yogurt so it’s full of protein! It’s the perfect snack or breakfast!\n\n### HOW DO YOU MAKE A HEALTHY STRAWBERRY BANANA SMOOTHIE?\n\nLet’s walk through the process of making this easy strawberry banana smoothie step-by-step! As long as you have a  [blender](http://www.dpbolvw.net/click-8438233-13531953)  and all the ingredients on hand, this smoothie can literally come together in 3 minutes flat!\n\n#### 1: GATHER THE INGREDIENTS\n\nWe’ll chat more about the ingredients and possible substitutions later, but before you can make this healthy Strawberry Banana Smoothie you need to gather all the ingredients. There are a few things to take into account when choosing the ingredients to make this Strawberry Banana Smoothie recipe….\n\n#### 2. PUT THE INGREDIENTS INTO THE  [BLENDER](http://www.dpbolvw.net/click-8438233-13531953)\n\nPut the ingredients for this Strawberry Banana Smoothie recipe into the container of your  [blender](http://www.dpbolvw.net/click-8438233-13531953)  in the order listed. There is always a rhyme and reason behind why I write the order of ingredients in my recipes, especially when it comes to using a blender!\n\n#### 3. BLEND!\n\nOnce the ingredients are all inside the blender, secure the lid and blend! Start on low speed and increase to high.\n\nBlend on high speed for 30-60 seconds, or until the mixture is smooth and uniform throughout. If using a Vitamix, don’t be afraid to use the tamper to push the ingredients down into the blades to achieve the best consistency (especially if you are using frozen fruit)!\n\n#### 4. SERVE IMMEDIATELY!\n\nPour this smoothie into four glasses, pass them out and let everyone enjoy this Strawberry Banana Smoothie as soon as it has finished blending!\n\nMy kids and husband all raved about this healthy Strawberry Banana Smoothie. They loved it and guzzled down every last drop!","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2019/01/healthy-strawberry-banana-smoothie-recipe-7-849x1024.jpg","category":{"$oid":"5cf66f9e2277ec7dc493287d"},"createdAt":{"$date":{"$numberLong":"1559654992010"}},"updatedAt":{"$date":{"$numberLong":"1559654992010"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf672f82277ec7dc4932882"},"title":"Peanut butter hot chocolate","text":"![image](https://joyfoodsunshine.com/wp-content/uploads/2018/11/peanut-butter-hot-chocolate-recipe-10-768x856.jpg)\n\nThis healthy Peanut Butter Hot Chocolate Recipe is creamy, chocolatey and bursting with peanut butter flavor! It’s vegan, dairy-free, and gluten-free with a refined sugar-free option (but can also be made with regular milk or cream)! This easy homemade hot chocolate is ready in 10 minutes and a perfect warm treat to enjoy after playing in the snow!\n\n### HOW DO YOU MAKE PEANUT BUTTER HOT CHOCOLATE?\n\nThis Peanut Butter Hot Chocolate recipe seriously couldn’t get any easier (watch the video to see what I mean)! But I want to give you a few tips and tricks to make sure your this recipe turns out perfectly every single time!\n\n1.  **Cook over low heat.** Cooking this peanut butter hot chocolate recipe in a saucepan over low heat is the best way to ensure that the chocolate melts evenly and the milk doesn’t burn!\n2.  **Whisk a lot!** It’s important to whisk this peanut butter hot chocolate recipe pretty consistently to avoid lumps, and to prevent the ingredients from sticking to the bottom of the pan!\n3.  **Do not add all the ingredients at once.** Another way to ensure silky smooth peanut butter hot chocolate is to make sure the first five ingredients are fully combined and smooth before adding the last two ingredients. Cocoa powder can be tricky to incorporate into a mixture that isn’t fully smooth!","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2018/11/peanut-butter-hot-chocolate-recipe-10-768x856.jpg","category":{"$oid":"5cf66fb62277ec7dc493287e"},"createdAt":{"$date":{"$numberLong":"1559655160026"}},"updatedAt":{"$date":{"$numberLong":"1559655160026"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf673882277ec7dc4932883"},"title":"Homemade healthy coffee creamer","text":"![image](https://joyfoodsunshine.com/wp-content/uploads/2016/06/healthy-coffee-creamer-recipe-paleo-vegan-5.jpg)\n\nHomemade Healthy Coffee Creamer Recipe (Paleo & Vegan)! A 4 ingredient, easy recipe that’s healthier than store-bought creamers!\n\nA good friend once said to me, “drinking tea is like getting a friendly handshake, but drinking coffee is like getting a warm hug.” It’s so _so_ true.\n\n### HOW DO YOU MAKE HEALTHY COFFEE CREAMER?\n\nLet’s walk through the steps in making this healthy vanilla coffee creamer!\n\n1.  **Warm & Whisk ingredients.** Making his coconut milk coffee creamer as actually super simple! Just place the ingredients (except for vanilla beans) into a small saucepan and whisk to combine.\n2.  **Watch it carefully.** Next, warm the mixture until it just begins to boil then remove the pan from the heat. Be very careful not to actually let it boil, because it will result in a big mess!\n3.  **Add the vanilla bean seeds and pods.** Next, scrape the seeds and stir them into the warm paleo coffee creamer mixture. Then add the whole vanilla bean pods.\n4.  **Cover & let the flavors blend.** After the vanilla beans and pods are added, cover the pot, and let it sit for 30 minutes for the vanilla bean flavor to really infuse into the healthy coffee creamer.\n5.  **Strain & store.**Choose a large glass jar and place a [fine mesh metal sieve](https://amzn.to/2M2rxyf)  over it. Strain the vanilla coffee creamer into the jar and discard the vanilla bean pods.\n\n### IS COFFEE CREAMER BAD FOR YOU?\n\nIf you’re curious about the benefits of making your own coffee creamer, check out this article from Prevention Magazine, where this very recipe was featured, “[5 Worst Things in your Coffee Creamer – And What You Should Use Instead](http://www.prevention.com/eatclean/5-worst-ingredients-in-coffee-creamer).”\n\nWhile some store bought varieties are not good (at all), this homemade paleo coffee creamer IS totally healthy! It’s dairy-free, refined-sugar free, vegan and paleo! It adds the perfect flavor and creaminess to your coffee without sacrificing health or taste! PLUS it is only 4 ingredients and is crazy easy!","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2016/06/healthy-coffee-creamer-recipe-paleo-vegan-5.jpg","category":{"$oid":"5cf671442277ec7dc493287f"},"createdAt":{"$date":{"$numberLong":"1559655304850"}},"updatedAt":{"$date":{"$numberLong":"1559655304850"}},"__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5cf6754d2277ec7dc4932884"},"title":"Dairy-free mocha latte","text":"![image](https://joyfoodsunshine.com/wp-content/uploads/2018/07/dairy-free-mocha-latte-recipe-vitamix-aer-6.jpg)\n\nThis dairy-free mocha latte recipe is so amazing you will feel like you are drinking a high-end latte from a fancy coffee shop…but in the comfort of your own home and for a fraction of the price! It’s easy to make, healthy (paleo, vegan, with NO refined sugar) and out-of-this-world delicious!\n\n### HOW TO SERVE A MOCHA LATTE\n\nFor an  **iced latte**, pour the finished product from the  [Vitamix Aer Disc Container](http://www.anrdoezrs.net/click-8438233-13345184)  into cups or mugs filled with ice cubes.\n\nFor a  **warm mocha latte**, pour the finished latte from the  [Vitamix Aer Disc Container](http://www.anrdoezrs.net/click-8438233-13345184)  into your favorite mugs!\n\n### HOW DO YOU FROTH MILK AT HOME?\n\nThe beauty of the  [Vitamix Aer Disc Container](http://www.anrdoezrs.net/click-8438233-13345184)  is that it does the milk-frothing for you! The proof is in the pudding, look at that foam (as I mentioned before). I try to be choosy with the appliances I have in my kitchen, which is why I LOVE that the  [Aer Disc Container](http://www.anrdoezrs.net/click-8438233-13345184)  turns my  [Vitamix](http://www.jdoqocy.com/click-8438233-13084479)into a latte-making machine!\n\nIf you have a  [milk frother](https://amzn.to/2KEHi1h), you may use that instead of the Vitamix. I recommend whisking or blending the ingredients (coffee, honey, vanilla and cocoa powder) together first, frothing the milk, then pouring the frothed milk into the the mixed ingredients!\n\n### WHAT IS THE RATIO OF ESPRESSO TO MILK IN A LATTE?\n\nIn this recipe I used a 1:1 ratio of coffee to coconut milk. Feel free to adjust the ratio to your liking if you so desire\n\n### IS ALMOND MILK GOOD FOR LATTES?\n\nMeh. I would say it’s not the best. I think fat is a key component in a truly amazing mocha latte. So I’d stick with coconut milk for this mocha latte recipe!","imageURL":"https://joyfoodsunshine.com/wp-content/uploads/2018/07/dairy-free-mocha-latte-recipe-vitamix-aer-6.jpg","category":{"$oid":"5cf671442277ec7dc493287f"},"createdAt":{"$date":{"$numberLong":"1559655757795"}},"updatedAt":{"$date":{"$numberLong":"1559655757795"}},"__v":{"$numberInt":"0"}}
